const products = [
  {
    _id: "1",
    name:
      "گوشی موبایل سامسونگ مدل Galaxy A12 SM-A125F/DS دو سیم کارت ظرفیت 64 گیگابایت",
    imgUrl: "/images/phone-small.jpeg",
    description:
      "گوشی A12 یکی دیگر از میان رده‌های شرکت سامسونگ است که در تاریخ 24 نوامبر 2020 معرفی شد. شرکت سامسونگ برای این محصول خود از یک صفحه‌نمایش 6.5 اینچی با رزولوشن 1600 در 720 پیکسل، استفاده کرده است. این صفحه‌نمایش در هر اینچ 264 پیکسل را نشان می‌دهد که از جزئیات و وضوح تصویر خوبی برخوردار است. تراشه‌ این محصول Mediatek MT6765 Helio P35 از تراشه‌های ۱۲ نانومتری سامسونگ است که با پردازنده مرکزی هشت هسته‌ای Cortex-A55 و پردازنده گرافیکی PowerVR GE8320 همراه شده است. این تراشه برای بازکردن چندین برنامه به‌صورت هم‌زمان و تماشای ویدئو مناسب است. این گوشی با 4 گیگابایت رم و 64 گیگابایت حافظه داخلی عرضه شده است و با استفاده از یک کارت حافظه‌ی جانبی قادر خواهید بود. بر روی قاب پشتی A12 یک دوربین چهارگانه قرار گرفته است. یک لنز عریض با رزولوشن 48 مگاپیکسل، یک لنز فوق عریض با رزولوشن 5 مگاپیکسل، یک لنز ماکرو با رزولوشن 2 مگاپیکسل و یک حسگر عمق 2 مگاپیکسلی مجموعه دوربین A12 را تشکیل می‌دهد. برای دوربین سلفی هم یک لنز 8 مگاپیکسلی از نوع عریض انتخاب شده است که در گوشه بالای صفحه‌نمایش قرار گرفته است. منبع انرژی گوشی A12 یک باتری لیتیوم-پلیمری با ظرفیت 5000 میلی‌آمپرساعت است که از فناوری شارژ سریع 15 واتی هم پشتیبانی می‌کند. شرکت سامسونگ این گوشی را با طراحی کاملاً مطلوب و امکانات فراوان به بازار عرضه کرده است تا در بازار میان‌رده‌ها هم حرفی برای گفتن داشته باشد",
    brand: "سامسونگ",
    countInStock: 12,
    price: 4119000,
    rating: 3.6,
    nReviews: 3,
  },
  {
    _id: "2",
    name: "لپ تاپ 15 اینچی ایسوس مدل VivoBook R521JP -MR",
    imgUrl: "/images/asus-smal.jpg",
    description:
      "لپ‌تاپ « R521JP » از محصولات سری «VivoBook» شرکت «ایسوس» محسوب می‌شود که با طراحی زیبا روانه بازار شده است. این لپ‌تاپ به‌واسطه‌ی قابلیت‌ها و امکاناتی که دارد، علاوه‌بر کاربری معمول روزمره، برای کاربری مالتی‌مدیا هم مناسب است. بدنه‌ی شیک R521JP به‌گونه‌ای طراحی شده که لپ‌تاپی رده‌بالا را نوید می‌دهد. این بدنه 23.4 میلی‌متر ضخامت و 1.7کیلوگرم وزن دارد و برای جابه‌جایی دائمی آن مشکل خاصی نخواهید داشت. صفحه‌نمایش 15.6 اینچی این محصول، پنل TFT با وضوح Full HD و روکش مات است. وجود بلندگوهای قوی ایسوس هم کاربری این لپ‌تاپ را به‌عنوان یک محصول مالتی‌مدیا تقویت می‌کند. پورت‌های متعدد و متنوعی روی لبه‌های R521JP دیده می‌شود که با استفاده از آن‌ها می‌توان انواع ابزارهای جانبی را بدون نیاز به هیچ مبدلی به این لپ‌تاپ متصل و از آن‌ها استفاده کرد. ایسوس در کنار این امکانات متعدد، از سخت‌افزارهای خوبی هم در این محصول استفاده کرده است. پردازنده‌ی مرکزی 10نانومتری و کم‌مصرف اما قوی Core i5 1035G1 اینتل، پردازشگر گرافیکی GeForce MX330 انویدیا، 8 گیگابایت رم از نوع DDR4 و یک ترابایت حافظه هارد دیسک مجموعه‌ سخت‌افزاری این کانفیگ را تشکیل می‌دهند که برای کاربری روزمره مطلوب هستند.",
    brand: "ایسوس",
    countInStock: 5,
    price: 21950000,
    rating: 3.5,
    nReviews: 34,
  },
  {
    _id: "3",
    name:
      "کنسول بازی سونی مدل Playstation 4 Slim کد Region 2 CUH-2216B ظرفیت یک ترابایت",
    imgUrl: "/images/ps4-small.jpg",
    description:
      "شرکت سونی یکی از بهترین تولیدکنندگان کنسول‌های قدرتمند بازی در جهان بوده که طرفداران زیادی دارد. علاقه‌مندان به کنسول‌های بازی را می‌توان به عنوان متعصب‌ترین افراد به حساب آورد. یکی از کنسول‌های سونی را می‌توان پلی استیشن 4 دانست که طرفداران زیادی دارد و شرکت‌های تولیدکننده بازی هم توانسته‌اند موفقیت‌های زیادی را با آن به دست آورند. خرید یک پلی استیشن 4 می‌تواند برای فرزندان و حتی افراد با سنین بالا هم مناسب و سرگرم‌کننده باشد. بد نیست بدانید که این دستگاه در مدل‌های مختلفی عرضه شده است.",
    brand: "سونی",
    countInStock: 0,
    price: 21950000,
    rating: 3.5,
    nReviews: 34,
  },
  {
    _id: "4",
    name: "ماوس بی سیم تسکو مدل TM 700W",
    imgUrl: "/images/index.jpeg",
    description:
      "برخی از ماوس‌ها علی‌رغم کارایی نه‌چندان پیشرفته و حرفه‌ای، ظاهری خاص و شبیه به ماوس‌های رده‌بالای مخصوص بازی دارند و از این بابت می‌توانند جذابیت‌های خاص خود را داشته باشند و ظاهری متفاوت به میز کامپیوتر شما دهند. یکی از همین دست محصولات ماوس مدل TM 286 ساخت شرکت تسکو است که اتصال از نوع با‌سیم با رابط USB و طول کابل 1.5 متری دارد. این ماوس از نوع اپتیکال با دقت متوسط 1200dpi است. البته این میزان dpi را می‌توان بین 1200 و 800 تغییر داد. روی این ماوس 6 کلید تعبیه شده که معمولا در مدل‌های حرفه‌ای شاهد این تعداد کلید هستیم. بدنه TM 286 طراحی خاصی با زوایای شکسته دارد و نکته مثبت اینجاست که این طراحی به‌صورت قرینه بوده و با هر دو دست می‌توان با این ماوس کار کرد. مشکلی که معمولا در ماوس‌های با ظاهر متفاوت وجود دارد و معمولا فقط مخصوص راست دست‌ها طراحی می‌شوند. روی این ماوس با لایه‌ای از پلاستیک ضدتعریق و ضد لغزش پوشانده شده که در استفاده‌های طولانی مدت باعث آزار کاربر نشو",
    brand: "تسکو",
    countInStock: 5,
    price: 103000,
    rating: 3.5,
    nReviews: 34,
  },

  {
    _id: "5",
    name:
      "دوربین دیجیتال کانن مدل EOS 4000D به همراه لنز 18-55 میلی متر DC III ",
    imgUrl: "/images/canon-small.jpg",
    description:
      "دوربین جدید EOS 4000D از شرکت کانن، جدیدترین دوربین از سری دوربین‌های DSLR رده پایین کانن است که به تازگی و تقریباً هم‌زمان با دوربین دیگری از این گروه یعنی EOS 2000D معرفی شد. این دوربین که در بازارهای آمریکا با نام EOS Rebel T7 شناخته می‌شود، ساده‌ترین و ارزان‌ترین دوربین DLSR (سری دوربین‌ها با لنز قابل تعویض) این شرکت است که به نظر می‌آید بیشتر از اینکه یک گام رو به جلو باشد، نوعی نوسازی مدل‌های قدیمی به شمار می‌رود. این دوربین برای کسانی است که می‌خواهند یک دوربین DSLR داشته باشند، اما قیمت آن خیلی خیلی برایشان اهمیت دارد و دوربین Canon EOS 4000D ، ارزان‌ترین گزینه موجود کانن است که حتی از دوربین پایین رده و ارزان قیمت EOS 1300D هم قیمت پایین‌تری دارد. این دوربین همه آنچه که از یک دوربین ارزان قیمت DSLR انتظار دارید (مانند حسگر بزرگ APS-C، منظره‌یاب نوری، کنترل‌ دستی نوردهی، امکان نصب فلاش‌های اکسترنال و عکاسی در آتلیه و …) را در اختیارتان می‌گذارد",
    brand: "کانن",
    countInStock: 12,
    price: 9550000,
    rating: 4.4,
    nReviews: 11,
  },
  {
    _id: "6",
    name: "هدفون تسکو مدل TH 5336 ",
    imgUrl: "./images/tsco-headphone-small.jpg",
    description:
      "هدفون «TH 5336» محصولی از شرکت «تسکو» (Tsco) است که از طریق فناوری بلوتوث به تلفن‌همراه یا پخش‌کننده‌ی صوتی شما متصل می‌شود. هدفون‌ها از نظر نوع قرارگیری روی گوش به انواع مختلفی تقسیم می‌شوند. هدفون TH 5336 از نوع روگوشی است. علاوه بر اتصال بی‌سیم بلوتوث، این هدفون دارای جک 3.5 میلی‌متری برای اتصال به موبایل یا پخش‌کننده‌های فاقد بلوتوث است. همچنین می‌توانید به آن کارت‌حافظه‌ TF متصل کنید. جنس بدنه‌ی این محصول از PVC باکیفیت است که می‌تواند در برابر بسیاری از صدمات روزمره مقاومت بسیار خوبی از خود نشان دهد. این هدفون منبع‌تغذیه خود را از یک باتری داخلی تامین می‌کند که 300 میلی‌آمپر ظرفیت دارد و می‌تواند تا 5 ساعت به پخش‌موسیقی بپردازد. فرمت‌های صوتی متنوعی در آن پشتیبانی می‌شود تا کاربران بتوانند به راحتی فایل‌های موسیقی خود را استفاده کند. یکی از ویژگی‌های TH 5336 داشتن میکروفن برای مکالمه است که می‌توانید تا 5 ساعت مکالمه داشته باشید. این هدفون از طریق درگاه microUSB شارژ می‌شود . 2 الی 3 ساعت نیاز دارد تا کاملا شارژ شود. گفتنی است، به همراه این هدفون یک کابل شارژ microUSB و یک کابل AUX وجود دارد. پس دیگر نیازی به تهیه کابل‌های جداگانه برای شارژ و انتقال صدا ندارید. ",
    brand: "تسکو",
    countInStock: 5,
    price: 430000,
    rating: 3.9,
    nReviews: 6,
  },
  {
    _id: "7",
    name: "پرینتر لیزری اچ پی مدل LaserJet Pro M12a",
    imgUrl: "/images/hp-small.jpg",
    description:
      "دستگاه LaserJet Pro M12a ساخت شرکت HP یکی از مدل‌های پایین رده‌ی این شرکت در دسته‌ی پرینترهای لیزری و سیاه‌و‌سفید است که درواقع می‌توان آن را جایگزینی برای مدل‌های HP LaserJet Pro P1109w یا HP LaserJet P1102W دانست. پرینترهای لیزری برای چاپ متن به کار می‌روند و سرعت و کیفیت خوبی در این زمینه ارائه می‌دهند. این پرینتر ظرفیتی برابر با 150 برگ در سینی ورودی خود دارد و ازاین‌رو برای استفاده‌های خانگی بسیار مناسب است. برخلاف مدل M12w این دستگاه از اتصال بی‌سیم WiFi بهره‌ای نبرده و نمی‌توان به‌صورت بی‌سیم و بی‌نیاز از کابل با این دستگاه کار کرد. با توجه به کاربری دستگاه می‌توانید آن را در محیط‌های اداری کوچک هم استفاده کنید اما توجه داشته باشید که گروهی که از این پرینتر استفاده می‌کند از 3 رایانه تجاوز نکند.",
    brand: "اچ پی",
    countInStock: 8,
    price: 4200000,
    rating: 2.4,
    nReviews: 83,
  },
  {
    _id: "8",
    name: "مانیتور ایسوس مدل VX279HG سایز 27 اینچ",
    imgUrl: "/images/asus-small.jpg",
    description:
      "مانیتور ۲۴ اینچی ASUS VA24EHE دارای پنل IPS با رزولوشن Full-HD و دقت رنگ بالا و قدرت نمایش رنگ‌هایی زنده و شاداب است و توانایی نمایش تصاویر بدون افت کیفیت را تا زاویه ۱۷۸ درجه دارد. همچنین رفرش ریت این مانیتور تا ۷۵Hz بالا می‌رود و از فناوری‌های Adaptive-Sync و FreeSync پشتیبانی می‌کند تا تصاویری روان و بدون سایه افتادن در جابه‌جایی تصاویر را به شما نمایش دهد. همچنین با داشتن فناوری‌های Flicker-Free و Low Blue Light با استاندارد TÜV Rheinland از چشمان شما در مقابل پرتو‌های آسیب زننده محافظت می‌کند. زاویه دید ۱۷۸ درجه پنل این مانیتور نیز به معنای نمایش رنگ‌ها با دقت بالا و بدون تغییر در زاویه‌های مختلف است. طراحی با فریم‌های بسیار باریک این مانیتور باعث می‌شوند تا در هنگام استفاده از چندین مانیتور در کنار هم مزاحمت کمتری توسط بردارهای تصویر وجود داشته باشد و شما را در عمق تصویر رو‌به‌رویتان قرار دهد. Adaptive-Sync و FreeSync باعث می‌شوند تا در هنگام نمایش تصاویری که با سرعت بالا حرکت می‌کنند از پارگی تصویر در هنگام رفرش شدن تصویر مانیتور جلوگیری شود تا تصاویر بسیار روانی را در اختیار شما قرار دهد. این قابلیت‌ها و رفرش ریت بالا باعث می‌شود تا در بازی‌های آنلاین و حساس دست بالاتری را در مقابل حریفان خود داشته باشید. تکنولوژی GamePlus در مانیتورهای ایسوس به شما پوشش‌های CrossHair، تایمر، شمارنده FPS و ابزار Alignment تصویر را به شما ارائه می‌دهد تا هم در هنگام بازی و هم در هنگام کار به شما کمک کنند.",
    brand: "ایسوس",
    countInStock: 0,
    price: 4470000,
    rating: 4,
    nReviews: 22,
  },
  // {
  //   _id: "2",
  //   name: "",
  //   imgUrl: "",
  //   description: "",
  //   brand: "ایسوس",
  //   countInStock: 5,
  //   price: 21950000,
  //   rating: 3.5,
  //   nReviews: 34,
  // },
];

export default products;
